app/controllers/reports_controller.rb

  def index
    @adjectives=Adjective.all
    @words=Word.all
---
SELECT "adjectives".* FROM "adjectives"
SELECT "words".* FROM "words"