app/controllers/responses_controller.rb

  def index
    @app_data={}
    @app_data[:words]=Word.all
    @app_data[:adjectives]=Adjective.all
---
SELECT "words".* FROM "words"
SELECT "adjectives".* FROM "adjectives"

  def create
    @new_response = Response.new(params[:response])
    @new_response.save
---
INSERT INTO "responses" ("adjective_id", "created_at", "positive", "updated_at", "word_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["adjective_id", 4], ["created_at", Sat, 06 Jul 2013 18:44:07 UTC +00:00], ["positive", false], ["updated_at", Sat, 06 Jul 2013 18:44:07 UTC +00:00], ["word_id", 1]]