app/views/reports/index.html.slim

SELECT COUNT(*) FROM "responses" WHERE "responses"."adjective_id" = 98 AND "responses"."word_id" = 3 AND "responses"."positive" = 't'
---
      -@words.each do |word|
        td #{adjective.responses.where(word_id: word.id, positive: true).count}